---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotMoveBoundaryCondition
source: html/6d79a3aa-b090-a636-7449-f52788ca4aa0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotMoveBoundaryCondition Property

Can't move Boundary Conditions

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveBoundaryCondition { get; }
```